base/Catalogs/бит_СтруктураКонструктораПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтруктураКонструктораПравилТрансляции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКорреспонденцию</Name>
					<Comment>Учитывать корреспонденцию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КолонкиПравилТрансляции</Name>
					<Comment>Колонки правил трансляции</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Comment>Имя колонки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКолонки</Name>
							<Comment>Вид колонки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыКолонокПравилТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыЗначений</Name>
							<Comment>//содержит описание возможных типов значений</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложениеКолонки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ПоложенияКолонокТаблицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеБалансовый</Name>
							<Comment>Не балансовый</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСубконто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаСпискаВыбора</Name>
							<Comment>Использование кнопки списка выбора</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаВыбора</Name>
							<Comment>Использование кнопки выбора</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОткрытия</Name>
							<Comment>Использование кнопки открытия</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КнопкаОчистки</Name>
							<Comment>Использование кнопки выбора</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыЗначенийСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключатьВСлужебнуюОтметку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_СтруктураКонструктораПравилТрансляции/Forms/ФормаВыбораПоля/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Параметры.Свойство("Режим", Режим);
	Параметры.Свойство("АдресРеквизитыИсточника", АдресРеквизитыИсточника);
	Параметры.Свойство("АдресРеквизитыПриемника", АдресРеквизитыПриемника);
	Параметры.Свойство("Приемник", Приемник);
	Параметры.Свойство("Источник", Источник);
	Параметры.Свойство("ТекущееПоле", ТекущееПоле);
	
	ОбновитьДерево();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДереводанныеВыбор

&НаКлиенте
Процедура ДеревоДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоКнопкеОК();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПоКнопкеОК();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьДерево();
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоДанные, ДеревоДанные.ПолучитьЭлементы());	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция заполняет таблицу реквизитов источника.
// 
// Возвращаемое значение:
//  ТабВрем - ТаблицаЗначений.
// 
&НаСервере
Функция ЗаполнитьТаблицуРеквизитовИсточника()

	ТабВрем = Неопределено;
	Если ЗначениеЗаполнено(Источник) Тогда
	
		 ТабВрем = Справочники.бит_ПравилаЗаполненияПолейПриТрансляции.ЗаполнитьТаблицуРеквизитов(Источник);
		 АдресРеквизитыИсточника = ПоместитьВоВременноеХранилище(ТабВрем, УникальныйИдентификатор);
	
	КонецЕсли; 

	Возврат ТабВрем;
	
КонецФункции // ЗаполнитьТаблицуРеквизитовИсточника()

// Функция извлекает таблицу реквизитов источника из временного хранилища.
// 
// Возвращаемое значение:
//  ТабВрем - ТаблицаЗначений.
// 
&НаСервере
Функция ДанныеРеквизитовИсточника() 

	ТабВрем = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(АдресРеквизитыИсточника) Тогда	
		ТабВрем = ПолучитьИзВременногоХранилища(АдресРеквизитыИсточника);	
	КонецЕсли; 

	Если НЕ ТипЗнч(ТабВрем) = Тип("ТаблицаЗначений") Тогда		
		ТабВрем = ЗаполнитьТаблицуРеквизитовИсточника();			
	КонецЕсли; 
	
	Возврат ТабВрем;
	
КонецФункции // ДанныеРеквизитовИсточника()

// Функция заполняет таблицу реквизитов приемника.
// 
// Возвращаемое значение:
//  ТабВрем - ТаблицаЗначений.
// 
&НаСервере
Функция ЗаполнитьТаблицуРеквизитовПриемника()
	
	Если ЗначениеЗаполнено(Приемник) Тогда
		ТабВрем = Справочники.бит_ПравилаЗаполненияПолейПриТрансляции.ЗаполнитьТаблицуРеквизитов(Приемник);
		АдресРеквизитыПриемника = ПоместитьВоВременноеХранилище(ТабВрем, УникальныйИдентификатор);
	КонецЕсли; 
	
	Возврат ТабВрем;
	
КонецФункции

// Функция извлекает таблицу реквизитов приемника из временного хранилища.
// 
// Возвращаемое значение:
//  ТабВрем - ТаблицаЗначений.
// 
&НаСервере
Функция ДанныеРеквизитовПриемника()

	ТабВрем = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(АдресРеквизитыПриемника) Тогда
		ТабВрем = ПолучитьИзВременногоХранилища(АдресРеквизитыПриемника);
	КонецЕсли; 

	Если НЕ ТипЗнч(ТабВрем) = Тип("ТаблицаЗначений") Тогда
		ТабВрем = ЗаполнитьТаблицуРеквизитовПриемника();
	КонецЕсли; 	
	
	Возврат ТабВрем;
	
КонецФункции // ДанныеРеквизитовПриемника()

// Процедура обновляет дерево значений "ДеревоПолей".
// 
&НаСервере
Процедура ОбновитьДерево()
	
	ДеревоДанные.ПолучитьЭлементы().Очистить();
	
	ТаблицаИсточник = ДанныеРеквизитовИсточника();
	ТаблицаПриемник = ДанныеРеквизитовПриемника();
	
	НастройкиИзмерений = бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхИзмерений();
	
	Если ТаблицаИсточник = Неопределено ИЛИ ТаблицаПриемник = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	ДеревоПолей = Новый ДеревоЗначений;
	ДеревоПолей.Колонки.Добавить("Имя"              , Новый ОписаниеТипов("Строка"));
	ДеревоПолей.Колонки.Добавить("Синоним"          , Новый ОписаниеТипов("Строка"));
	ДеревоПолей.Колонки.Добавить("ДоступноДляВыбора", Новый ОписаниеТипов("Булево"));
	ДеревоПолей.Колонки.Добавить("Картинка");
		
	СтрокаВерх = ДобавитьСтрокуВДерево(ДеревоПолей, "ЗаписьИсточник", НСтр("ru='Запись источник';en='recording source'"), Ложь);
	
	Для каждого СтрокаТаблицы Из ТаблицаИсточник Цикл
		
		Справочники.бит_СтруктураКонструктораПравилТрансляции.ДобавитьИнформациюОбИзмерении(СтрокаТаблицы, НастройкиИзмерений); 
		
		ДобавитьСтрокуВДерево(СтрокаВерх,СтрокаТаблицы.ИмяРеквизита,СтрокаТаблицы.Синоним,Истина);
		
	КонецЦикла; 
	
	СтрокаВерх = ДобавитьСтрокуВДерево(ДеревоПолей, "ЗаписьПриемник", НСтр("ru='Запись приемник';en='recording receiver'"), Ложь);
	
	Для каждого СтрокаТаблицы Из ТаблицаПриемник Цикл
		
		Справочники.бит_СтруктураКонструктораПравилТрансляции.ДобавитьИнформациюОбИзмерении(СтрокаТаблицы, НастройкиИзмерений); 
		
		ДобавитьСтрокуВДерево(СтрокаВерх,СтрокаТаблицы.ИмяРеквизита,СтрокаТаблицы.Синоним,Истина);
		
	КонецЦикла; 
	
	СтрокаВерх = ДобавитьСтрокуВДерево(ДеревоПолей, "Прочее", НСтр("ru='Прочее';en='Other'"), Ложь);
	
	ДобавитьСтрокуВДерево(СтрокаВерх, "Условие"					 , НСтр("ru='Условие';en='Condition'"),	Истина);
	ДобавитьСтрокуВДерево(СтрокаВерх, "ДтКт"					 , НСтр("ru='Дт/Кт';en='Debit/Credit'"), Истина);	
	ДобавитьСтрокуВДерево(СтрокаВерх, "ПроизвольныйКод"			 , НСтр("ru='Произвольный код';en='arbitrary code'"), Истина);
	ДобавитьСтрокуВДерево(СтрокаВерх, "ДополнительноеПоле"		 , НСтр("ru='Дополнительное поле';en='Additional field'"), Истина);
	ДобавитьСтрокуВДерево(СтрокаВерх, "ДополнительноеПоле_Счет"	 , НСтр("ru='Дополнительный счет';en='Additional expense'"), Истина);
	ДобавитьСтрокуВДерево(СтрокаВерх, "КоэффициентСумма"		 , НСтр("ru='Коэффициент сумма';en='sum coefficient'"), Истина);		 
	ДобавитьСтрокуВДерево(СтрокаВерх, "КоэффициентКоличество"	 , НСтр("ru='Коэффициент количество';en='Quantity Coefficient'"), Истина);
	ДобавитьСтрокуВДерево(СтрокаВерх, "ИспользоватьАналитикуКорр", НСтр("ru='Использовать аналитику корр. счета';en='Use analytics corr. accounts'"), Истина);	
	
	ЗначениеВДанныеФормы(ДеревоПолей, ДеревоДанные);
	
КонецПроцедуры // Обновить()

&НаСервере
Функция ДобавитьСтрокуВДерево(СтрокаРодитель,Имя,Синоним,ДоступноДляВыбора)

	СтрокаДерева = СтрокаРодитель.Строки.Добавить();
	СтрокаДерева.Имя               = Имя;
	СтрокаДерева.Синоним           = Синоним;
	СтрокаДерева.ДоступноДляВыбора = ДоступноДляВыбора;

	Если НЕ ДоступноДляВыбора Тогда
		
		СтрокаДерева.Картинка = БиблиотекаКартинок.бит_Реквизиты;
		
	Иначе	
		
		СтрокаДерева.Картинка = БиблиотекаКартинок.бит_Реквизит;
		
	КонецЕсли; 
	
	Возврат СтрокаДерева;
	
КонецФункции // ДобавитьСтрокуВДерево()

&НаКлиенте
Процедура ПоКнопкеОК()
	
	ТекущаяСтрока = Элементы.ДеревоДанные.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено И ТекущаяСтрока.ДоступноДляВыбора Тогда
		
		ТекРодитель = ТекущаяСтрока.ПолучитьРодителя();
		ВидПоля     = ?(ТекРодитель = Неопределено, "", ТекРодитель.Имя);
		
		РезСтруктура = Новый Структура;
		РезСтруктура.Вставить("ВидПоля",ВидПоля);
		РезСтруктура.Вставить("Имя"    ,ТекущаяСтрока.Имя);
		
		Закрыть(РезСтруктура);
		
	КонецЕсли; 
	
КонецПроцедуры // ПоКнопкеОК()

#КонецОбласти
